Revit 2027 API
MechanicalSystem.SystemType Property
The type of this duct system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctSystemType SystemType { get; }
Public ReadOnly Property SystemType As DuctSystemType
	Get
public:
property DuctSystemType SystemType {
	DuctSystemType get ();
}
member SystemType : DuctSystemType with get
Property Value
DuctSystemType
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace